<?php 

// البرمجة الكائنية التوجه (OOP - Object-Oriented Programming) هي نمط برمجة يعتمد على مفهوم "الكائنات" (Objects) التي يمكن أن تحتوي على بيانات (تسمى خصائص أو صفات) و وظائف (تسمى أساليب أو طرق). الهدف الرئيسي من OOP هو تسهيل تطوير وصيانة البرمجيات من خلال تقسيمها إلى وحدات أصغر قابلة لإعادة الاستخدام.

//المفاهيم الأساسية في OOP:
// 1- الكائنات ( Objects)
// 2- الفئات  ( Classes )
// 3- الوراثة ( Inheritance )
// 4- التعددية  ( Polymorphism )
// 5- التغليف  ( Encapsulation )
// 6 - التجريد ( Abstraction )